erp3l/src/Catalogs/РабочиеЦентры/РабочиеЦентры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеЦентры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидРабочегоЦентра</name>
    <type>
      <types>CatalogRef.ВидыРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентВремениРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяЗагрузка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасценкаРабота</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>РасценкаПереналадка</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.ПроизводственныеУчастки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/РабочиеЦентры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ПараллельнаяЗагрузка = Ложь;
	ЕстьУчасток = Ложь;
		
	Если НЕ ВидРабочегоЦентра.Пустая() Тогда
		
		РеквизитыВидаРЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ВидРабочегоЦентра,
			"ПараллельнаяЗагрузка, Подразделение.ИспользоватьПроизводственныеУчастки");
		ПараллельнаяЗагрузка = РеквизитыВидаРЦ.ПараллельнаяЗагрузка;
		ЕстьУчасток = РеквизитыВидаРЦ.ПодразделениеИспользоватьПроизводственныеУчастки;
		
	КонецЕсли;
	
	Если НЕ ПараллельнаяЗагрузка Тогда
		МассивНепроверяемыхРеквизитов.Добавить("МаксимальнаяЗагрузка");
	КонецЕсли; 
	
	Если НЕ ЕстьУчасток Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Участок");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ВидРабочегоЦентра")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ВидРабочегоЦентра)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.ВидРабочегоЦентра, "ЭтоГруппа") Тогда
		
		ДанныеЗаполнения.Удалить("ВидРабочегоЦентра");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
